import sqlite3  # Импортируем встроенную библиотеку для работы с базами данных SQLite

conn = sqlite3.connect("../faces.db")  # Подключаемся к файлу базы данных "faces.db" 
cursor = conn.cursor()  # Создаем курсор инструмент для отправки запросов и получения ответов из базы

# Готовим SQL-запрос, чтобы вытащить данные (запрашиваем столбцы: id, имя и дату/время)
cursor.execute("""
SELECT id, name, date_time
FROM recognition_log
ORDER BY id DESC
""")  # Сортируем записи по столбцу 'id' от самых новых к самым старым (в обратном порядке)

rows = cursor.fetchall()  # Забираем все найденные строки из базы данных и сохраняем их в переменную 'rows'

print("Журнал распознаваний:")  # Выводим красивый заголовок в консоль перед списком записей

for row in rows:  # Запускаем цикл который по очереди берет каждую строчку из полученных результатов
    print(row)  # Печатаем текущую строку с данными (id, имя, дата) на экран

conn.close()  # Закрываем соединение с базой данных чтобы правильно освободить память и ресурсы системы
